#include "stdio.h"
int main(){
	int n;
	int i;
	scanf("%d",&n);
	if(n>=1 && n<=54){
		for(i=10000; i<=999999; i++){
			//判断五位十进制数 
			if(i>=10000 && i<=99999){
				//判断是否为回文数 
				if((i%10==i/10000)&&(i/10%10 == i/1000%10)){
					//判断n=i的位数么
					if(n == i%10+i/10%10+i/100%10+i/1000%10+i/10000){
						printf("%d\n",i);
					} 
				}
			}
			//判断六位十进制数 、
			if(i>=100000 && i<=999999){
				if((i/100000==i%10)&&(i/10000%10==i/10%10)&&(i/1000%10==i/100%10)){
					if(n == i/100000+i%10+i/10000%10+i/10%10+i/1000%10+i/100%10){
						printf("%d\n",i);
					}
				}
			} 
		}
	}else{
		printf("error");
	}
	return 0;
}
